benchmarking/after_optim_500.txt
Running 1m test @ http://127.0.0.1:8080/
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.85ms   10.40ms 202.79ms   96.32%
    Req/Sec    27.74k    15.74k   82.60k    52.71%
  13242584 requests in 1.00m, 0.94GB read
  Socket errors: connect 257, read 105, write 0, timeout 0
Requests/sec: 220337.02
Transfer/sec:     15.97MB