benchmarking/before_optim_10000.txt
Running 1m test @ http://127.0.0.1:8080/
  10 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.25ms    1.60ms  24.58ms   87.24%
    Req/Sec     1.00k     1.47k    6.98k    87.41%
  30237 requests in 1.00m, 2.25MB read
  Socket errors: connect 9757, read 33641, write 161, timeout 0
Requests/sec:    503.71
Transfer/sec:     38.37KB