benchmarking/before_optim_500.txt
Running 1m test @ http://127.0.0.1:8080/
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.60ms    1.56ms  15.70ms   85.70%
    Req/Sec   835.06    848.39     2.57k    79.57%
  29771 requests in 1.00m, 2.21MB read
  Socket errors: connect 257, read 33625, write 228, timeout 0
Requests/sec:    495.85
Transfer/sec:     37.77KB